; domain
(define (domain abyssus-base-t2)
    (
        :requirements
        :strips
        :typing
        :negative-preconditions
        :equality
        :disjunctive-preconditions
        :quantified-preconditions
        :conditional-effects
        :fluents
        :action-costs
    )
    (:types
        locatable location - object
        rov sample capsule - locatable
        pressure-sensitive - sample
        pressure-stabilizer docking-station - location
    )

    (:predicates
        ;; Positions and movement
        (at ?x - locatable ?l - location)
       (connected ?from - location ?to - location)
     (narrow-connected ?from - location ?to - location)

        ;; ROV state
        (carrying ?r - rov ?x - locatable)

        ;; Sample categories and final state
        (regular-sample ?s - sample)
        (stabilized ?s - sample)
        (stored ?s - sample)

        ;; Robot categories
        (small-robot ?r - rov)

        ;; Special locations
        (bio-vault ?l - location)

        ;; Capsule state
        (empty-capsule ?c - capsule)
        (sample-in-capsule ?s - sample ?c - capsule)
        (capsule-sealed ?c - capsule)
    
    )

    (:functions
        (battery-level ?r - rov)
        (total-cost)
        (capacity ?r - rov)
    )

    ;; ------------------------------------------------------------
    ;; Movement
    ;; ------------------------------------------------------------

    (:action move
        :parameters (?r - rov ?from - location ?to - location)
        :precondition 
        (and
            (not (= ?from ?to))
            (at ?r ?from)
            (connected ?from ?to) 
            (>= (battery-level ?r) 2)
        )
        :effect
        (and
            (not (at ?r ?from))
            (at ?r ?to)
            (decrease (battery-level ?r) 2)
            (increase (total-cost) 2)
        )
    )

    (:action move-through-narrow
        :parameters (?r - rov ?from - location ?to - location)
        :precondition
        (and
            (at ?r ?from)
            (narrow-connected ?from ?to)
            (small-robot ?r)
            (>= (battery-level ?r) 2)
        )
        :effect
        (and
            (not (at ?r ?from))
            (at ?r ?to)
            (decrease (battery-level ?r) 2)
            (increase (total-cost) 2)
        )
    )

    ;; ------------------------------------------------------------
    ;; Regular sample handling
    ;; ------------------------------------------------------------

    (:action pickup-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?s ?l)
            (regular-sample ?s)
            (>= (capacity ?r) 1)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (at ?s ?l))
            (carrying ?r ?s)
            (decrease (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action drop-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (carrying ?r ?s)
            (regular-sample ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?s))
            (at ?s ?l)
            (increase (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 50)
        )
    )

    (:action store-regular-sample
        :parameters (?r - rov ?s - sample ?l - location)
        :precondition (and
            (at ?r ?l)
            (bio-vault ?l)
            (carrying ?r ?s)
            (regular-sample ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?s))
            (stored ?s)
            (increase (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 0)
        )
    )

    ;; ------------------------------------------------------------
    ;; Pressure-sensitive sample handling with capsules
    ;; ------------------------------------------------------------

    (:action take-empty-capsule
        :parameters (?r - rov ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?c ?l)
            (empty-capsule ?c)
            (>= (capacity ?r) 1)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (at ?c ?l))
            (carrying ?r ?c)
            (decrease (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action encapsulate-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?s ?l)
            (carrying ?r ?c)
            (empty-capsule ?c)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (empty-capsule ?c))
            (not (at ?s ?l))
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 5)
        )
    )

    (:action pickup-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?c ?l)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (>= (capacity ?r) 1)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (at ?c ?l))
            (carrying ?r ?c)
            (decrease (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    (:action drop-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (carrying ?r ?c)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (carrying ?r ?c))
            (at ?c ?l)
            (increase (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 100)
        )
    )

    (:action stabilize-capsule
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - pressure-stabilizer)
        :precondition (and
            (at ?r ?l)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (not (stabilized ?s))
        )
        :effect (and
            (stabilized ?s)
            (increase (total-cost) 10)
        )
    )

    (:action store-sensitive-sample
        :parameters (?r - rov ?s - pressure-sensitive ?c - capsule ?l - location)
        :precondition (and
            (at ?r ?l)
            (bio-vault ?l)
            (carrying ?r ?c)
            (sample-in-capsule ?s ?c)
            (capsule-sealed ?c)
            (stabilized ?s)
            (>= (battery-level ?r) 1)
        )
        :effect (and
            (not (capsule-sealed ?c))
            (stored ?s)
            (empty-capsule ?c)
            (not (sample-in-capsule ?s ?c))
            (not (carrying ?r ?c))
            (at ?c ?l)
            (increase (capacity ?r) 1)
            (decrease (battery-level ?r) 1)
            (increase (total-cost) 1)
        )
    )

    ;; ------------------------------------------------------------
    ;; Recharge
    ;; ------------------------------------------------------------

    (:action recharge
        :parameters (?r - rov ?l - docking-station)
        :precondition (and (at ?r ?l) (< (battery-level ?r) 30))
        :effect (and (assign (battery-level ?r) 30) (increase (total-cost) 4))
    )
    
)

; problem
(define (problem t2)
    (:domain abyssus-base-t2)

    (:objects
        rov1 rov2 - rov
        s1 - sample
        s3 - pressure-sensitive
        cap1 cap2 - capsule
        wing_alpha wing_beta transfer_zone decompression_chamber bio_vault - location
        docking_station - docking-station
        pressure_stabilizer - pressure-stabilizer
    )

    (:init
        (narrow-connected transfer_zone wing_alpha)
        (narrow-connected wing_alpha transfer_zone)
        (connected transfer_zone wing_beta)
        (connected wing_beta transfer_zone)
        (connected transfer_zone docking_station)
        (connected docking_station transfer_zone)
        (connected transfer_zone decompression_chamber)
        (connected decompression_chamber transfer_zone)
        (connected decompression_chamber pressure_stabilizer)
        (connected pressure_stabilizer decompression_chamber)
        (connected decompression_chamber bio_vault)
        (connected bio_vault decompression_chamber)
        (connected pressure_stabilizer bio_vault)
        (connected bio_vault pressure_stabilizer)
        (bio-vault bio_vault)

        (at rov1 docking_station)
        (at rov2 docking_station)
        (small-robot rov1)
        (regular-sample s1)
        (at s1 wing_alpha)
        (at s3 wing_alpha)
        (at cap1 docking_station)
        (at cap2 docking_station)
        (empty-capsule cap1)
        (empty-capsule cap2)

        (= (battery-level rov1) 30)
        (= (battery-level rov2) 30)
        (= (capacity rov1) 1)
        (= (capacity rov2) 3)
        (= (total-cost) 0)
    )

    (:goal
        (and
            (forall (?s - sample)
                (stored ?s)
            )

            (forall (?s - pressure-sensitive)
                (stabilized ?s)
            )
        )
    )

    (:metric minimize (total-cost))
)

; plan
1. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 30 to 28
   goals met: 0 of 2
2. (move rov2 docking_station transfer_zone)
   deleted: (at rov2 docking_station)
   added: (at rov2 transfer_zone)
   changed: (battery-level rov2) from 30 to 28
   goals met: 0 of 2
3. (move rov2 transfer_zone decompression_chamber)
   deleted: (at rov2 transfer_zone)
   added: (at rov2 decompression_chamber)
   changed: (battery-level rov2) from 28 to 26
   goals met: 0 of 2
4. (move rov2 decompression_chamber pressure_stabilizer)
   deleted: (at rov2 decompression_chamber)
   added: (at rov2 pressure_stabilizer)
   changed: (battery-level rov2) from 26 to 24
   goals met: 0 of 2
5. (move-through-narrow rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 28 to 26
   goals met: 0 of 2
6. (pickup-regular-sample rov1 s1 wing_alpha)
   deleted: (at s1 wing_alpha)
   added: (carrying rov1 s1)
   changed: (capacity rov1) from 1 to 0, (battery-level rov1) from 26 to 25
   goals met: 0 of 2
7. (move-through-narrow rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 25 to 23
   goals met: 0 of 2
8. (drop-regular-sample rov1 s1 transfer_zone)
   deleted: (carrying rov1 s1)
   added: (at s1 transfer_zone)
   changed: (capacity rov1) from 0 to 1, (battery-level rov1) from 23 to 22
   goals met: 0 of 2
9. (move rov1 transfer_zone docking_station)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 docking_station)
   changed: (battery-level rov1) from 22 to 20
   goals met: 0 of 2
10. (take-empty-capsule rov1 cap1 docking_station)
   deleted: (at cap1 docking_station)
   added: (carrying rov1 cap1)
   changed: (capacity rov1) from 1 to 0, (battery-level rov1) from 20 to 19
   goals met: 0 of 2
11. (move rov1 docking_station transfer_zone)
   deleted: (at rov1 docking_station)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 19 to 17
   goals met: 0 of 2
12. (move-through-narrow rov1 transfer_zone wing_alpha)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 wing_alpha)
   changed: (battery-level rov1) from 17 to 15
   goals met: 0 of 2
13. (encapsulate-sample rov1 s3 cap1 wing_alpha)
   deleted: (empty-capsule cap1) (at s3 wing_alpha)
   added: (sample-in-capsule s3 cap1) (capsule-sealed cap1)
   changed: (battery-level rov1) from 15 to 14
   goals met: 0 of 2
14. (move-through-narrow rov1 wing_alpha transfer_zone)
   deleted: (at rov1 wing_alpha)
   added: (at rov1 transfer_zone)
   changed: (battery-level rov1) from 14 to 12
   goals met: 0 of 2
15. (move rov1 transfer_zone decompression_chamber)
   deleted: (at rov1 transfer_zone)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 12 to 10
   goals met: 0 of 2
16. (move rov1 decompression_chamber pressure_stabilizer)
   deleted: (at rov1 decompression_chamber)
   added: (at rov1 pressure_stabilizer)
   changed: (battery-level rov1) from 10 to 8
   goals met: 0 of 2
17. (drop-sensitive-sample rov1 s3 cap1 pressure_stabilizer)
   deleted: (carrying rov1 cap1)
   added: (at cap1 pressure_stabilizer)
   changed: (capacity rov1) from 0 to 1, (battery-level rov1) from 8 to 7
   goals met: 0 of 2
18. (stabilize-capsule rov1 s3 cap1 pressure_stabilizer)
   added: (stabilized s3)
   goals met: 1 of 2
19. (move rov1 pressure_stabilizer decompression_chamber)
   deleted: (at rov1 pressure_stabilizer)
   added: (at rov1 decompression_chamber)
   changed: (battery-level rov1) from 7 to 5
   goals met: 1 of 2
20. (pickup-sensitive-sample rov2 s3 cap1 pressure_stabilizer)
   deleted: (at cap1 pressure_stabilizer)
   added: (carrying rov2 cap1)
   changed: (capacity rov2) from 3 to 2, (battery-level rov2) from 24 to 23
   goals met: 1 of 2
21. (move rov2 pressure_stabilizer bio_vault)
   deleted: (at rov2 pressure_stabilizer)
   added: (at rov2 bio_vault)
   changed: (battery-level rov2) from 23 to 21
   goals met: 1 of 2
22. (store-sensitive-sample rov2 s3 cap1 bio_vault)
   deleted: (capsule-sealed cap1) (sample-in-capsule s3 cap1) (carrying rov2 cap1)
   added: (stored s3) (empty-capsule cap1) (at cap1 bio_vault)
   changed: (capacity rov2) from 2 to 3, (battery-level rov2) from 21 to 20
   goals met: 1 of 2
23. (move rov2 bio_vault decompression_chamber)
   deleted: (at rov2 bio_vault)
   added: (at rov2 decompression_chamber)
   changed: (battery-level rov2) from 20 to 18
   goals met: 1 of 2
24. (move rov2 decompression_chamber transfer_zone)
   deleted: (at rov2 decompression_chamber)
   added: (at rov2 transfer_zone)
   changed: (battery-level rov2) from 18 to 16
   goals met: 1 of 2
25. (pickup-regular-sample rov2 s1 transfer_zone)
   deleted: (at s1 transfer_zone)
   added: (carrying rov2 s1)
   changed: (capacity rov2) from 3 to 2, (battery-level rov2) from 16 to 15
   goals met: 1 of 2
26. (move rov2 transfer_zone decompression_chamber)
   deleted: (at rov2 transfer_zone)
   added: (at rov2 decompression_chamber)
   changed: (battery-level rov2) from 15 to 13
   goals met: 1 of 2
27. (move rov2 decompression_chamber bio_vault)
   deleted: (at rov2 decompression_chamber)
   added: (at rov2 bio_vault)
   changed: (battery-level rov2) from 13 to 11
   goals met: 1 of 2
28. (store-regular-sample rov2 s1 bio_vault)
   deleted: (carrying rov2 s1)
   added: (stored s1)
   changed: (capacity rov2) from 2 to 3, (battery-level rov2) from 11 to 10
   goals met: 2 of 2
